Revit 2026 API

# ScheduleFieldGetSchedulableField Method

---

Gets a SchedulableField object representing this field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SchedulableField GetSchedulableField()
```
```vb
Public Function GetSchedulableField As SchedulableField
```
```cpp
public:
SchedulableField^ GetSchedulableField()
```
```fsharp
member GetSchedulableField : unit -> SchedulableField
```

#### Return Value

SchedulableField The SchedulableField object.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | This ScheduleField is not a schedulable field by type(non-calculated/non-combined-parameter). |

A ScheduleableField cannot be obtained for: \- Calculated fields \- Combined parameters

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace